{
  "header": {
    "parsing_order": [
      {
        "s": [
          "global_attributes"
        ]
      },
      {
        "o": [
          "dimensions",
          "general",
          "drifter_institution",
          "drifter_characteristics",
          "drifter_deployment",
          "drifter_configuration",
          "drifter_sensor",
          "drifter_calibration",
          "drifter_measurements",
          "drifter_greylist",
          "drifter_history"
        ]
      }
    ]
  },
  "sections": {
    "global_attributes": {
      "elements": {
        "title": {
          "description": "A succinct description of what is in the dataset."
        },
        "institution": {
          "description": "Specifies where the original data was produced."
        },
        "source": {
          "description": "The method of production of the original data. If it was model-generated, source should name the model and its version, as specifically as could be useful. If it is observational, source should characterize it (e.g., 'surface observation' or 'radiosonde')."
        },
        "history": {
          "description": "Provides an audit trail for modifications to the original data. Well-behaved generic NetCDF filters will automatically append their name and the parameters with which they were invoked to the global history attribute of an input NetCDF file. We recommend that each line begin with a timestamp indicating the date and time of day that the program was executed."
        },
        "data_mode": {
          "description": "Indicates if the file contains real-time, delayed mode or mixed data."
        },
        "references": {
          "description": "Published or web-based references that describe the data or methods used to produce it."
        },
        "comment": {
          "description": "Miscellaneous information about the data or methods used to produce it."
        },
        "user_manual_version": {
          "description": "The version number of the user manual"
        },
        "Conventions": {
          "description": "The conventions supported by this file, blank separated"
        },
        "netcdf_version": {
          "description": "Netcdf version used for the data file."
        },
        "doi": {
          "description": "List of Data Object Identifiers (DOI) related to this data file (blank separated)."
        },
        "citation": {
          "description": "The citation to be used in publications using the data file."
        },
        "qc_manual": {
          "description": "ntains the name of the manual that describes the quality control procedure."
        },
        "time_coverage_start": {
          "description": "Start date of the data in UTC. See note on time format below."
        },
        "time_coverage_end": {
          "description": "Final date of the data in UTC. See note on time format below."
        },
        "geospatial_lat_min": {
          "description": "Southernmost valid latitude, a value between -90 and 90 decimal degrees. This is calculated from the valid latitudes in the file."
        },
        "geospatial_lat_max": {
          "description": "Northernmost valid latitude, a value between -90 and 90 decimal degrees. This is calculated from the valid latitudes in the file."
        },
        "geospatial_lon_min": {
          "description": "Westernmost valid longitude, a value between -180 and 180 decimal degrees. This is calculated from the valid longitudes in the file."
        },
        "geospatial_lon_max": {
          "description": "Easternmost valid longitude, a value between -180 and 180 decimal degrees. This is calculated from the valid longitudes in the file."
        },
        "geospatial_lat_start": {
          "description": "First valid latitude, a value between -90 and 90 decimal degrees. This is calculated from the valid latitudes in the file."
        },
        "geospatial_lat_end": {
          "description": "Last valid latitude, a value between -90 and 90 decimal degrees. This is calculated from the valid latitudes in the file."
        },
        "geospatial_lon_start": {
          "description": "First valid longitude, a value between -180 and 180 decimal degrees. This is calculated from the valid longitudes in the file."
        },
        "geospatial_lon_end": {
          "description": "Last valid longitude, a value between -180 and 180 decimal degrees. This is calculated from the valid longitudes in the file."
        },
        "drogue_off_time": {
          "description": "Drogue off date in UTC. See note on time format below."
        },
        "drogue_off_latitude": {
          "description": "Drogue off latitude, a value between -90 and 90 decimal degrees."
        },
        "drogue_off_longitude": {
          "description": "Drogue off longitude, a value between -180 and 180 decimal degrees."
        }
      }
    },
    "dimensions": {
      "elements": {
        "N_TIME": {
          "description": "Number of time steps."
        },
        "N_LEVEL": {
          "description": "Maximum number of parameter measurements that can be simultaneously sampled by a sensor."
        },
        "STRING": {
          "description": "String dimensions."
        },
        "DATE_TIME": {
          "description": "This dimension is the length of an ASCII date and time value. DATE_TIME convention is: YYYYMMDDHHMISS"
        },
        "DATE": {
          "description": "This dimension is the length of an ASCII date value. DATE convention is: YYYYMMDD"
        },
        "N_TRANS_SYSTEM": {
          "description": "Number of transmission systems."
        },
        "N_POSITIONING_SYSTEM": {
          "description": "Number of positioning systems."
        },
        "N_LAUNCH_CONFIG_PARAM": {
          "description": "Number of pre-deployment or launch configuration parameters."
        },
        "N_CONFIG_PARAM": {
          "description": "Number of configuration parameters."
        },
        "N_MISSION": {
          "description": "Number of missions."
        },
        "N_SENSOR": {
          "description": "Number of sensors mounted on the drifter and used to measure the parameters."
        },
        "N_PARAM": {
          "description": "Number of parameters measured by the drifter or calculated from transmitted parameters."
        },
        "N_HISTORY": {
          "description": "Number of history records."
        },
        "N_GREYLIST": {
          "description": "Number of greylist records."
        }
      }
    },
    "general": {
      "elements": {
        "DATA_TYPE": {
          "description": "This field contains the type of data contained in the file. The list of acceptable data types is in the Reference Table 1. Example : “C-RAID drifter time-series data”"
        },
        "FORMAT_VERSION": {
          "description": "File format version."
        },
        "REFERENCE_DATE_TIME": {
          "description": "Date of reference for Julian days. The recommended reference date time is “19500101000000” : January 1st 1950 00:00:00"
        },
        "DATE_CREATION": {
          "description": "Date and time (UTC) of creation of this file. Format : YYYYMMDDHHMISS. Example : 20011229161700 : December 29th 2001 16:17:00"
        },
        "DATE_UPDATE": {
          "description": "Date and time (UTC) of update of this file. Format : YYYYMMDDHHMISS. Example : 20011230090500 : December 30th 2001 09:05:00"
        }
      }
    },
    "drifter_institution": {
      "elements": {
        "PI_NAME": {
          "description": "Name of the principal investigator in charge of the drifter. Example: TBD."
        },
        "PI_EMAIL": {
          "description": "Email address of the principal investigator in charge of the drifter. Example: TBD."
        },
        "INSTITUTION": {
          "description": "Preferably institution of the principal investigator in charge of the drifter. Example: TBD."
        },
        "INSTITUTION_REFERENCES": {
          "description": "References to preferably institution of the principal investigator in charge of the drifter, the place to find all information on the data file (web-base, i.e. give URLs). Example: ”http://www.nocs.uk”."
        },
        "PROJECT_NAME": {
          "description": "Name of the project which operates the drifter. Example: TBD."
        },
        "DRIFTER_OWNER": {
          "description": "The owner of the drifter (may be different from the data centre and operating institution). Example: TBD."
        },
        "OPERATING_INSTITUTION": {
          "description": "The operating institution of the drifter (may be different from the drifter owner and data centre). Example: TBD."
        },
        "OPERATING_COUNTRY": {
          "description": "The operating country of the drifter. Example: TBD."
        },
        "AUTHORS": {
          "description": "List of relevant persons involved in the creation of the data file (comma separated). Example: TBD."
        },
        "DATA_CENTRE": {
          "description": "Code of the data centre in charge of the float data management. The data centre codes are described in the Reference Table 4. Example: “IF” for Ifremer."
        },
        "DAC_FORMAT_ID": {
          "description": "Format numbers used by individual DACs to describe each drifter type. Example: TBD."
        }
      }
    },
    "drifter_characteristics": {
      "elements": {
        "PLATFORM_FAMILY": {
          "description": "Category of instrument. See Reference Table 19. Example: TBD."
        },
        "DRIFTER_TYPE": {
          "description": "Type of drifter. See Reference Table 20. Example: TBD."
        },
        "DRIFTER_MAKER": {
          "description": "Name of the drifter manufacturer. See Reference Table 21. Example: TBD."
        },
        "DRIFTER_MANUFACTURE_DATE": {
          "description": "Date of the drifter manufacture. Format : YYYYMMDD. Example: “20011230” for December 30th 2001."
        },
        "DRIFTER_SERIAL_NO": {
          "description": "This field should contain only the serial number of the drifter. Example: TBD."
        },
        "DRIFTER_NUMBER": {
          "description": "C-RAID drifter unique identifier. Example: “1190171”"
        },
        "DRIFTER_DAC_NUMBER": {
          "description": "DAC drifter unique identifier. Example: “9706311”"
        },
        "DRIFTER_WMO_NUMBER": {
          "description": "WMO drifter identifier. WMO is the World Meteorological Organization. This platform number is unique. Example: “3200552”"
        },
        "WMO_INST_TYPE": {
          "description": "Instrument type from WMO code table 1770. A subset of WMO table 1770 is documented in the Reference Table 8. Example: TBD."
        },
        "PIT": {
          "description": "Transmission identifier of the drifter. Example: “11195”"
        },
        "TRANS_SYSTEM": {
          "description": "Name of the telecommunication system from Reference Table 10. Example: “ARGOS”"
        },
        "TRANS_SYSTEM_ID": {
          "description": "Program identifier of the telecommunication subscription. DACS can use N/A or alternative of their choice when not applicable. Example: “221” is a program number for all the beacons of an Argos customer."
        },
        "TRANS_SYSTEM_FORMAT": {
          "description": "Binary format used to relay the data to shore. This entry may point to a table where each entry links to external documents (with DOIs). For example, for Iridium SBD data formats for drifters, there is this document: doi: 10.5281/zenodo.1305119. A similar document for ARGOS drifter data formats would be ideal."
        },
        "POSITIONING_SYSTEM": {
          "description": "Position system from Reference Table 9. Example: “ARGOS”"
        },
        "CONTROLLER_BOARD_TYPE": {
          "description": "Describes the type of controller board. Example: TBD."
        },
        "CONTROLLER_BOARD_SERIAL_NO": {
          "description": "The serial number for the primary controller board. Example: TBD."
        },
        "FIRMWARE_VERSION": {
          "description": "The drifter firmware version. This is specified as per the format on the manufacturer’s manual. Example: TBD."
        },
        "FLOAT_DIAMETER": {
          "description": "Diameter of the float."
        },
        "SUBSURFACE_FLOAT_PRESENCE": {
          "description": "Is the drifter equipped with a subsurface float? Example: TBD."
        },
        "DROGUE_TYPE": {
          "description": "The type of the drogue. Example: TBD."
        },
        "DROGUE_DIAMETER": {
          "description": "Diameter of the drogue."
        },
        "DROGUE_LENGTH": {
          "description": "Length of the drogue."
        },
        "DROGUE_CENTER_DEPTH": {
          "description": "Depth of the center of the drogue."
        },
        "DRAG_AREA_ABOVE_DROGUE": {
          "description": "Drag area of all drifter components except the drogue."
        },
        "DRAG_AREA_OF_DROGUE": {
          "description": "Drag area of the drogue."
        },
        "DRAG_AREA_RATIO": {
          "description": "Ratio of the drogue cross-sectional area to the area of all other Components."
        },
        "DROGUE_DETECTION_METHOD": {
          "description": "Method used to detect drogue presence. Example: TBD."
        },
        "DROGUE_BALLAST": {
          "description": "Weight of the drogue ballast."
        },
        "BATTERY_TYPE": {
          "description": "Describes the type of battery packs in the drifter. Example: “Alkaline”, “Lithium” or “Alkaline and Lithium”"
        },
        "BATTERY_PACKS": {
          "description": "Describes the configuration of battery packs in the drifter, number and type. Example: “4DD Li + 1C Alk”"
        },
        "BATTERY_CAPACITY": {
          "description": "Capacity of the battery at drifter deployment."
        },
        "SPECIAL_FEATURES": {
          "description": "Additional float features can be specified here such as algorithms used by the drifter. Example: TBD."
        },
        "DRIFTER_MANUAL_VERSION": {
          "description": "The version date or number for the manual for each drifter. Example: TBD."
        },
        "ANOMALY": {
          "description": "This field describes any anomaly or problem the drifter may have had. Example: TBD."
        },
        "CUSTOMISATION": {
          "description": "Free form field to record changes made to the drifter after manufacture and before deployment, i.e. this could be the customisation institution plus a list of modifications. Example: TBD."
        }                                                                                        
      }
    },
    "drifter_deployment": {
      "elements": {
        "LAUNCH_DATE": {
          "description": "Date and time (UTC) of launch of the drifter. Format : YYYYMMDDHHMISS. Example: “20011230090500” for December 30th 2001 09:05:00."
        },
        "LAUNCH_LATITUDE": {
          "description": "Latitude of the drifter launch. Unit: decimal degree north. Example: 44.4991 for 44° 29’ 56.76’’ N"
        },
        "LAUNCH_LONGITUDE": {
          "description": "Longitude of the drifter launch. Unit: decimal degree east. Example: 16.7222 for 16° 43’ 19.92’’ E"
        },
        "LAUNCH_QC": {
          "description": "Quality flag on drifter launch date, time and location. The flag scale is described in the Reference Table 2. Example: 1 (launch time and location seems correct)."
        },
        "STARTUP_DATE": {
          "description": "Date and time (UTC) of the activation of the drifter before or just after deployment. Format: YYYYMMDDHHMISS. Example: “20011230090500” for December 30th 2001 09:05 :00."
        },
        "STARTUP_DATE_QC": {
          "description": "Quality flag on startup date. The flag scale is described in the Reference Table 2. Example: 1 (startup date seems correct)."
        },
        "DEPLOYMENT_PLATFORM": {
          "description": "Identifier of the deployment platform, i.e. vessel or ship name. Example: “L’ATALANTE”."
        },
        "DEPLOYMENT_CRUISE_ID": {
          "description": "Identification number or reference number of the cruise used to deploy the platform. Example: “POMME2”."
        },
        "DEPLOYMENT_REFERENCE_STATION_ID": {
          "description": "Identifier or reference number of co-located CTD or XBT stations used to verify the drifter measurements. Example: 58776, 58777"
        },
        "DEPLOYMENT_OPERATOR": {
          "description": "Name of the person in charge of the drifter deployment."
        },
        "DEPLOYMENT_BATTERY_VOLTAGE": {
          "description": "Battery voltage at deployment."
        },
        "DROGUE_OFF_DATE": {
          "description": "Date (UTC) of the loss of the drogue. Format: YYYYMMDDHHMISS. Example: “20011230090500” for December 30th 2001 09:05:00"
        },
        "DROGUE_OFF_LATITUDE": {
          "description": "Latitude of the loss of the drogue. Unit: decimal degree north. Example: 44.4991 for 44° 29’ 56.76’’ N"
        },
        "DROGUE_OFF_LONGITUDE": {
          "description": "Longitude of the loss of the drogue. Unit: decimal degree east. Example: 16.7222 for 16° 43’ 19.92’’ E"
        },
        "DROGUE_OFF_QC": {
          "description": "Quality flag on drogue loss date, time and location. The flag scale is described in the Reference Table 2. Example: 1 (drogue loss time and location seems correct)."
        },
        "END_MISSION_DATE": {
          "description": "Date (UTC) of the end of mission of the drifter. Format: YYYYMMDDHHMISS. Example: “20011230090500” for December 30th 2001 09:05:00"
        },
        "END_MISSION_LATITUDE": {
          "description": "Latitude at end of the mission. Unit: decimal degree north. Example: 44.4991 for 44° 29’ 56.76’’ N"
        },
        "END_MISSION_LONGITUDE": {
          "description": "Longitude at end of the mission. Unit: decimal degree east. Example: 16.7222 for 16° 43’ 19.92’’ E"
        },
        "END_MISSION_QC": {
          "description": "Quality flag on end mission date, time and location.The flag scale is described in the Reference Table 2. Example: 1 (launch time and location seems correct)."
        },
        "END_MISSION_STATUS": {
          "description": "Status of the end of the float’s deployment. See Reference Table 16. Example: TBD."
        },
        "ODDS_AGROUND": {
          "description": "Probability that the drifter ran aground."
        },
        "ODDS_PICKUP": {
          "description": "Probability that the drifter was picked up."
        }
      }
    },
    "drifter_configuration": {
      "elements": {
        "LAUNCH_CONFIG_PARAMETER_NAME": {
          "description": "Name of the configuration parameter; pre-deployment or launch settings. See Reference Table 13 for standard configuration parameter names. Example: TBD."
        },
        "LAUNCH_CONFIG_PARAMETER_VALUE": {
          "description": "Value of the configuration parameter; either pre-deployment or launch settings. Example: TBD."
        },
        "CONFIG_PARAMETER_NAME": {
          "description": "Name of the configuration parameter; mission settings. See Reference Table 13 for standard configuration parameter names. Example: TBD."
        },
        "CONFIG_PARAMETER_VALUE": {
          "description": "Value of the configuration parameter; mission settings. Example: TBD."
        },
        "CONFIG_MISSION_NUMBER": {
          "description": "Unique number of the mission to which the measurement belongs."
        },
        "CONFIG_MISSION_COMMENT": {
          "description": "Comment on this configuration mission. Example: TBD."
        }
      }
    },
    "drifter_sensor": {
      "elements": {
        "SENSOR": {
          "description": "Names of the sensors mounted on the drifter. See Reference Table 22. Example: TBD."
        },
        "SENSOR_MAKER": {
          "description": "Name of the manufacturer of the sensor. See Reference Table 23. Example: TBD."
        },
        "SENSOR_MANUFACTURE_DATE": {
          "description": "Date of the sensor manufacture. Format : YYYYMMDD. Example: “20011230” for December 30th 2001."
        },
        "SENSOR_MODEL": {
          "description": "Model of sensor. See Reference Table 24. Example: TBD."
        },
        "SENSOR_SERIAL_NO": {
          "description": "Serial number of the sensor. Example: TBD."
        },
        "SENSOR_NB_LEVEL": {
          "description": "Number of measurements levels of the sensor. Example: TBD."
        },
        "SENSOR_LEVEL_DEPTH": {
          "description": "Theoretical depth of sensor measurements. Example: TBD."
        },
        "SENSOR_INITIAL_END_DATE": {
          "description": "Date (UTC) of end of useful mission for the sensor, according to the initial platform operators. Format: YYYYMMDDHHMISS. Example: “20011230090500” for December 30th 2001 09:05:00"
        },
        "PARAMETER": {
          "description": "Names of the parameters measured by drifter sensors or derived from drifter measurements. The parameter names are listed in Reference Table 3. Examples: TBD."
        },
        "PARAMETER_SENSOR": {
          "description": "Names of the sensors that measured the drifter parameters. See Reference Table 22. Example: TBD."
        },
        "PARAMETER_UNITS": {
          "description": "Units of accuracy and resolution of the parameter. Example: TBD."
        },
        "PARAMETER_ACCURACY": {
          "description": "Accuracy of the parameter. Example: TBD."
        },
        "PARAMETER_RESOLUTION": {
          "description": "Resolution of the parameter returned by the sensor (note that this is not necessarily equivalent to the resolution of the parameter returned by the drifter through telemetry). Example: TBD."
        },
        "PARAMETER_DATA_STATE_INDICATOR": {
          "description": "Degree of processing the parameter data has passed through. The parameter data state indicator is described in the Reference Table 6."
        }
      }
    },
    "drifter_calibration": {
      "elements": {
        "PREDEPLOYMENT_CALIB_EQUATION": {
          "description": "Predeployment calibration equation for this parameter. Example: “Tc = a1 * T + a0”."
        },
        "PREDEPLOYMENT_CALIB_COEFFICIENT": {
          "description": "Predeployment calibration coefficients for this equation. Example: “a1=0.99997 , a0=0.0021”."
        },
        "PREDEPLOYMENT_CALIB_COMMENT": {
          "description": "Comments applying to this parameter predeployment calibration. Example: TBD."
        },
        "PREDEPLOYMENT_CALIB_DATE": {
          "description": "Date of the pre-deployment calibration. Example: “20011217161700” for November 17th 2001 16:17:00."
        },
        "REAL_TIME_ADJUSTMENT_CALIB_EQUATION": {
          "description": "Real-time adjustment calibration equation applied to the parameter. Example: “Tc = a1 * T + a0”."
        },
        "REAL_TIME_ADJUSTMENT_CALIB_COEFFICIENT": {
          "description": "Real-time adjustment calibration coefficients for this equation. Example: “a1=0.99997 , a0=0.0021”."
        },
        "REAL_TIME_ADJUSTMENT_CALIB_COMMENT": {
          "description": "Comment about this real-time adjustment calibration Example: TBD."
        },
        "REAL_TIME_ADJUSTMENT_CALIB_DATE": {
          "description": "Date of the real-time adjustment calibration. Example: “20011217161700” for November 17th 2001 16:17:00."
        },
        "SCIENTIFIC_CALIB_EQUATION": {
          "description": "Scientific calibration equation applied to the parameter. Example: “Tc = a1 * T + a0”."
        },
        "SCIENTIFIC_CALIB_COEFFICIENT": {
          "description": "Scientific calibration coefficients for this equation. Example: “a1=0.99997 , a0=0.0021”."
        },
        "SCIENTIFIC_CALIB_COMMENT": {
          "description": "Comment about this scientific calibration Example: TBD."
        },
        "SCIENTIFIC_CALIB_DATE": {
          "description": "Date of the scientific calibration. Example: “20011217161700” for November 17th 2001 16:17:00."
        }
      }
    },
    "drifter_measurements": {
      "elements": {
        "JULD": {
          "description": "Julian day of the location (or measurement). The integer part represents the day, the decimal part represents the time of the measurement. Date and time are in universal time coordinates. The Julian day is relative to REFERENCE_DATE_TIME. JULD(N_TIME) should be filled and its values should be unique within the file. Example: 18833.8013889885 for July 25th 2001 19:14:00"
        },
        "JULD_STATUS": {
          "description": "Status flag on JULD date and time. The flag scale is described in Reference Table 15. Example: “2”: Value is transmitted by the drifter.v"
        },
        "JULD_QC": {
          "description": "Quality flag on JULD date and time. The flag scale is described in the Reference Table 2. Example: 1 (date and time seem correct)."
        },
        "JULD_ADJUSTED": {
          "description": "Adjusted Julian day of the location (or measurement). The integer part represents the day, the decimal part represents the time of the measurement. Date and time are in universal time coordinates. The Julian day is relative to REFERENCE_DATE_TIME. The date may be adjusted due to float clock drift or expert review. Example: 18833.8013889885 for July 25th 2001 19:14:00"
        },
        "JULD_ADJUSTED_STATUS": {
          "description": "Status flag on JULD date and time. The flag scale is described in Reference Table 15. Example: “2”: Value is transmitted by the drifter."
        },
        "JULD_ADJUSTED_QC": {
          "description": "Quality flag on JULD_ADJUSTED date and time. The flag scale is described in the Reference Table 2. Example: 1 (date and time seem correct)."
        },
        "JULD_QC_FAILED": {
          "description": "Number of the QC test that set the QC failed flag. This information also concerns QC = 2 flags; if QC = 1, the FillValue is inserted. Example: TBD."
        },
        "LATITUDE": {
          "description": "Latitude of the location (or measurement). Unit: decimal degree north. Example: 44.4991 for 44° 29’ 56.76’’ N."
        },
        "LONGITUDE": {
          "description": "Longitude of the location (or measurement). Unit: decimal degree east. Example: 16.7222 for 16° 43’ 19.92’’ E."
        },
        "POSITION_ACCURACY": {
          "description": "Position accuracy received from the positioning system. The location classes from Argos are described in the Reference Table 5. A ”G” indicates the GPS positioning system. Examples: “3” for a latitude an longitude accuracy < 250 m. “G” for GPS accuracy."
        },
        "POSITION_QC": {
          "description": "Quality flag on position. The flag on position is set according to (JULD, LATITUDE, LONGITUDE) quality. The flag scale is described in the Reference Table 2. Example: 1 (position seems correct)."
        },
        "POSITION_QC_FAILED": {
          "description": "Number of the QC test that set the QC failed flag. This information also concerns QC = 2 flags; if QC = 1, the FillValue is inserted. Example: TBD."
        },
        "AXES_ERROR_ELLIPSE_MAJOR": {
          "description": "Major axis of error ellipse reported by the positioning system."
        },
        "AXES_ERROR_ELLIPSE_MINOR": {
          "description": "Minor axis of error ellipse reported by the positioning system."
        },
        "AXES_ERROR_ELLIPSE_ANGLE": {
          "description": "Angle of error ellipse reported by the positioning system."
        },
        "SATELLITE_NAME": {
          "description": "Satellite name from positioning system."
        },
        "<PARAM>": {
          "description": "<PARAM> contains the original values of a parameter listed in the ”code” column of Reference Table 3. <X>: these fields are specified in the columns of the Reference Table 3."
        },
        "<PARAM>_QC": {
          "description": "Quality flag applied on each <PARAM> values. The flag scale is specified in Reference Table 2. Example: 1 (value seems correct)."
        },
        "<PARAM>_ADJUSTED": {
          "description": "<PARAM>_ADJUSTED contains the adjusted values derived from the original values of the parameter. The list of adjustable parameters is provided in Reference Table 3. <X>: these fields are specified in the columns of the Reference Table 3. When no adjustment is performed, the FillValue is inserted."
        },
        "<PARAM>_ADJUSTED_QC": {
          "description": "Quality flag applied on each <PARAM>_ADJUSTED values. The flag scale is specified in Reference Table 2. When no adjustment is performed, the FillValue is inserted. Example: 1 (value seems correct)."
        },
        "<PARAM>_ADJUSTED_ERROR": {
          "description": "<PARAM>_ADJUSTED_ERROR contains the error on the adjusted values of the parameter. <X>: these fields are specified in the columns of the Reference Table 3. <PARAM>_ADJUSTED_ERROR is mandatory for adjustable parameters. When no adjustment is performed, the FillValue is inserted."
        },
        "<PARAM>_QC_FAILED": {
          "description": "Number of the QC test that set the QC failed flag (in <PARAM>_QC or <PARAM>_ADJUSTED_QC depending of the PARAMETER_DATA_MODE). This information also concerns QC = 2 flags; if QC = 1, the FillValue is inserted. Example: TBD."
        },
        "PARAMETER_DATA_MODE": {
          "description": "Describe the data mode of the individual parameter: R: real time data; D: delayed mode data; A: real time data with adjusted values"
        },
        "CONFIG_MISSION_NUMBER_INDEX": {
          "description": "Unique number of the mission to which this measurement belongs."
        },
        "GROUNDED": {
          "description": "GROUNDED indicates the best estimate of whether the drogue touched the ground for that location. The conventions are described in Reference Table 18. Example: TBD."
        },
        "DATA_STATUS": {
          "description": "Status flag on the data associated to the current timestamp. The flag scale is described in Reference Table 17. Example: TBD."
        }
      }
    },
    "drifter_greylist": {
      "elements": {
        "GREYLIST_PARAMETER": {
          "description": "Name of the parameter concerned by the greylist information. Example: ”SST”. If parameter = “MISSION”, all the parameters (geophysical and location) are affected by the given QC."
        },
        "GREYLIST_START_DATE": {
          "description": "Start date that concerns the greylist information. Example: ”20011217160057” for December 17th 2001 16:00:57."
        },
        "GREYLIST_END_DATE": {
          "description": "End date that concerns the greylist information. Example: ”20011217160057” for December 17th 2001 16:00:57."
        },
        "GREYLIST_FLAG": {
          "description": "Quality flag applied on parameter QC values. Example: ‘1’ (value seems correct)."
        },
        "GREYLIST_COMMENT": {
          "description": "Comment on this greylist information. Example: “sensor biased”."
        }
      }
    },
    "drifter_history": {
      "elements": {
        "HISTORY_INSTITUTION": {
          "description": "Institution that performed the action. Institution codes are described in Reference Table 4. Example: ”IF” for Ifremer."
        },
        "HISTORY_STEP": {
          "description": "Code of the step in data processing for this history record. The step codes are described in Reference Table 12. Example: TBD."
        },
        "HISTORY_SOFTWARE": {
          "description": "Name of the software that performed the action. This code is institution dependent. Example: TBD."
        },
        "HISTORY_SOFTWARE_RELEASE": {
          "description": "Version of the software. This name is institution dependent. Example: ”1.0”."
        },
        "HISTORY_REFERENCE": {
          "description": "Code of the reference database used for quality control in conjunction with the software. This code is institution dependent. Example: TBD."
        },
        "HISTORY_DATE": {
          "description": "Date of the action. Example: ”20011217160057” for December 17th 2001 16:00:57."
        },
        "HISTORY_ACTION": {
          "description": "Name of the action. The action codes are described in Reference Table 7. Example: TBD."
        },
        "HISTORY_PARAMETER": {
          "description": "Name of the parameter on which the action is performed. Example: ”PSAL”."
        },
        "HISTORY_PREVIOUS_VALUE": {
          "description": "Parameter or flag of the previous value before action. Example: “2” (probably good) for a flag that was changed to “1” (good)."
        },
        "HISTORY_START_TIME_INDEX": {
          "description": "Start time index the action is applied to. Example: 100"
        },
        "HISTORY_STOP_TIME_INDEX": {
          "description": "Stop time index the action is applied to. Example: 150"
        },
        "HISTORY_QCTEST": {
          "description": "This field records the tests performed when ACTION is set to QCP$ (QC performed), the test failed when ACTION is set to QCF$ (QC failed). The QCTEST codes are described in Reference Table 11. Example: ”0A” (in hexadecimal form)"
        }
      }
    }  
  }
}
